app/views/books/_form.html.erb

      <%= f.label :author %><br />
      <%= select("book", "author_id", Author.all.collect {|a| [ a.name, a.id ] }, { :include_blank => 'Select Book Author' })%>
---
SELECT `authors`.* FROM `authors`

      <%= f.label :location_id %><br />
      <%= select("book", "location_id", Location.all.collect {|a| [ a.name, a.id ] }, { :include_blank => 'Select Book Location' })%>
---
SELECT `locations`.* FROM `locations`