app/controllers/books_controller.rb

  def index
    if params[:order_by] == "author"
      @books = Book.order("authors.name").all(:include => ["author","location"])
---
SELECT `books`.* FROM `books` ORDER BY books.update_at DESC, books.order_id ASC

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO `books` (`author_id`, `created_at`, `created_by`, `location_id`, `name`, `price`, `quantity`, `updated_at`) VALUES (2, '2013-04-22 18:03:26', NULL, 4, 'The Secrete', 22.0, 11, '2013-04-22 18:03:26')

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `author_id` = 1, `price` = 122.0, `updated_at` = '2013-04-22 18:55:41' WHERE `books`.`id` = 1